# PlasticvinylColorByObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlasticVinyl..::..PlasticvinylColorByObject Property
PlasticVinyl Class See Also
---
The property labeled "Color By Object" from the "PlasticVinyl" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string PlasticvinylColorByObject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PlasticvinylColorByObject As String
	Get
```

Visual C++
---
```text
public:
static property String^ PlasticvinylColorByObject {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace